Repository: UNB-PI2-Grupo3-BracoRobotico/MedGrabber-Frontend
Catalog: lib/l10n/intl_*.arb
Languages: pt_br

# continue_button_label
source: Continue
pt_br: Continuar

# start_button_label
source: Get Started
pt_br: Iniciar

# forgotten_password_button_label
source: Reset password
pt_br: Resetar senha

# login_error_title
source: Login failed!
pt_br: Login falhou!

# login_success_message
source: You are being redirected to the home screen...
pt_br: Você está sendo redirecionado para a tela de home...

# login_email_pattern_error_description
source: Incorrect e-mail format!
pt_br: Formatação do e-mail está incorreta!

# forgotten_password_message
source: Forgotten password?
pt_br: Esqueceu sua senha?

# forgotten_password_title
source: Forgotten password
pt_br: Esqueceu sua senha

# forgotten_password_email_sended_title
source: Email sent successfully!
pt_br: Email enviado com sucesso!

# forgotten_password_email_sended_message
source: Please check your inbox for password reset instructions.
pt_br: Por favor verifique sua caixa de mensagem para alteração da senha

# forgotten_password_desc
source: Enter your email and we will send you a password reset link
pt_br: Insira seu email e enviaremos código para resetar sua senha.

# forgotten_password_email_not_found
source: Email Not founded!
pt_br: Email não encontrado!

# go_to_login_page_button_label
source: I have an account
pt_br: Já tenho uma conta

# register_user_button_label
source: Register user
pt_br: Registrar usuário

source: Try again
pt_br: Tentar novamente

source: Help
pt_br: Ajuda

source: Save
pt_br: Salvar

source: Got it
pt_br: Entendi

source: Something went wrong
pt_br: Algo deu errado

# bottom_navigation_help_option
source: Help
pt_br: Ajuda

# bottom_navigation_settings_option
source: Settings
pt_br: Configurações

# bottom_navigation_home_option
source: Home
pt_br: Início

# bottom_navigation_notifications_option
source: Notifications
pt_br: Notificações

# setup_machine_loading_title
source: Setting up your machine...
pt_br: Configurando sua máquina...

# setup_machine_success_title
source: Arm configurated!
pt_br: Braço configurado!

# setup_machine_error_title
source: Something went wrong
pt_br: Algo deu errado

# setup_machine_error_description
source: It was not possible to set up your machine. Try again, if the error persists contact our team.
pt_br: Não foi possível configurar sua máquina. Tente novamente. Caso o erro persista, contate nossa equipe.

# settings_title
source: Settings
pt_br: Configurações

# settings_name_option_title
source: Name
pt_br: Nome

# settings_phone_option_title
source: Phone
pt_br: Telefone

# name_page_title
source: Store's Name
pt_br: Nome da Loja

# name_page_description
source: Modify your store's name so that clients can see the updated name. Your name must follow these <bold>rules: • Cannot start with numbers • Must be at max 25 characters long</bold>
pt_br: Modifique o nome da loja que seus clientes irão enxergar durante as compras. Seu nome deve seguir algumas <bold>regras: • Não pode começar com números • Deve ter ao máximo 25 caracteres</bold>

# name_page_field_error_cannot_start_with_number
source: The store name cannot start with number
pt_br: O nome da loja não pode começar com número

# name_error_page_title
source: Something went wrong
pt_br: Algo deu errado

# name_error_page_description
source: We couldn't update your store's name. Please try again or change the inserted name.
pt_br: Nós não conseguimos atualizar o nome da sua loja. Por favor, tente novamente ou troque o nome inserido.

# name_error_page_primary_button_label
source: Try again
pt_br: Tentar novamente

# name_error_page_secondary_button_label
source: Change name
pt_br: Trocar nome

# name_loading_page_title
source: Updating your store's name...
pt_br: Atualizando o nome da sua loja...

# name_success_page_title
source: Store name updated!
pt_br: Nome da loja atulizado!

# phone_page_title
source: Phone Number
pt_br: Telefone

# phone_page_description
source: Modify the number of your store to keep clients informed during their purchases.
pt_br: Modifique o número de telefone/celular da sua sua loja para manter seus clientes informados durante as compras.

# phone_page_error_bottomsheet_title
source: Invalid number
pt_br: Número invalido

# phone_page_error_bottomsheet_description
source: Please recheck the phone number you inserted. Just to remember the phone number must be from Brazil.
pt_br: Verifique novamente o número inserido. Lembrando, o número inserido deve ser do Brasil.

# phone_page_error_page_title
source: Something went wrong
pt_br: Algo deu errado

# phone_page_error_page_description
source: It wasn't possible to update your phone number. Try again, if the error persists, contact our team.
pt_br: Não foi possível atualizar seu número de telefone. Tente novamente, caso o erro persista, contate nossa equipe.

# phone_page_success_title
source: Phone number updated!
pt_br: Número de telefone atualizado!

# phone_page_loading_title
source: Updating your phone number...
pt_br: Atualizando o número do seu telefone...

# on_boarding_token_page_title
source: Machine Code
pt_br: Código da máquina:

# on_boarding_token_page_description
source: Enter the token provided by the development team to connect with the machine.
pt_br: Insira o token fornecido pela equipe de desenvolvimento para conectar com máquina.

# on_boarding_token_page_error_bottomsheet_title
source: Invalid Code! Please try again
pt_br: Código inválido! Tente novamente

# on_boarding_token_page_error_bottomsheet_description
source: If the problem persists, contact the development team.
pt_br: Caso problema persista entre em contato com equipe de desenvolvimento

# on_boarding_token_page_error_page_title
source: Unexpected Error! Contact the development team to provide a new Code
pt_br: Erro inesperado! Entre em contato com equipe de desenvolvimento para providenciarmos novo Código

# on_boarding_token_page_error_page_description
source: Code cannot be null.
pt_br: Código não pode ser nulo.

# on_boarding_token_page_success_title
source: Machine Code successfully linked!
pt_br: Código da máquina vinculado com sucesso!

# on_boarding_token_page_loading_title
source: Linking machine code...
pt_br: Vinculando código da máquina...

# on_boarding_email_page_description
source: Enter your email to proceed with onboarding.
pt_br: Insira o seu email para prosseguir com o onboarding.

# on_boarding_email_page_error_bottomsheet_title
source: Invalid Email! Please try again.
pt_br: Email inválido! Por favor, tente novamente.

# on_boarding_email_page_error_bottomsheet_description
source: Email is already registered or has an incorrect format!
pt_br: Email já cadastrado anteriormente ou com formatação incorreta!

# on_boarding_email_page_error_page_title
source: Unexpected Error! Please try again later or contact support for assistance.
pt_br: Erro inesperado! Por favor, tente novamente mais tarde ou entre em contato com o suporte para obter ajuda.

# on_boarding_email_page_error_page_description
source: Email cannot be empty.
pt_br: O email não pode estar vazio.

# on_boarding_email_page_success_title
source: Email Successfully Added!
pt_br: Email adicionado com sucesso!

# on_boarding_email_page_loading_title
source: Adding email...
pt_br: Adicionando email...

# on_boarding_phone_page_title
source: Phone Number:
pt_br: Número de telefone:

# on_boarding_phone_page_description
source: Enter your phone number to proceed with onboarding.
pt_br: Insira o seu número de telefone para prosseguir com o onboarding.

# on_boarding_phone_page_error_bottomsheet_title
source: Invalid Phone Number! Please try again.
pt_br: Número de telefone inválido! Por favor, tente novamente.

# on_boarding_phone_page_error_bottomsheet_description
source: If the problem persists, please check your phone number and try again.
pt_br: Se o problema persistir, verifique o número de telefone e tente novamente.

# on_boarding_phone_page_error_page_title
source: Unexpected Error! Please try again later or contact support for assistance.
pt_br: Erro inesperado! Por favor, tente novamente mais tarde ou entre em contato com o suporte para obter ajuda.

# on_boarding_phone_page_error_page_description
source: Phone number cannot be empty.
pt_br: O número de telefone não pode estar vazio.

# on_boarding_phone_page_success_title
source: Phone Number Successfully Added!
pt_br: Número de telefone adicionado com sucesso!

# on_boarding_phone_page_loading_title
source: Adding phone number...
pt_br: Adicionando número de telefone...

# on_boarding_password_page_title
source: Password:
pt_br: Senha:

# on_boarding_password_confirm_page_title
source: Confirm Password:
pt_br: Confirmar Senha:

# on_boarding_password_page_description
source: Enter a password for your account with at least 8 characters.
pt_br: Digite uma senha para sua conta com pelo menos 8 caracteres.

# on_boarding_password_page_error_bottomsheet_title
source: Invalid Password! Please try again.
pt_br: Senha inválida! Por favor, tente novamente.

# on_boarding_password_page_error_bottomsheet_description
source: Passwords are not the same or have fewer than 8 characters.
pt_br: Senha não estão iguais ou possuem menos que 8 caracteres

# on_boarding_password_page_error_page_title
source: Unexpected Error! Please try again later or contact support for assistance.
pt_br: Erro inesperado! Por favor, tente novamente mais tarde ou entre em contato com o suporte para obter ajuda.

# on_boarding_password_page_error_page_description
source: Password cannot be empty.
pt_br: A senha não pode estar vazia.

# on_boarding_password_page_success_title
source: Password Successfully Set!
pt_br: Senha definida com sucesso!

# on_boarding_password_page_loading_title
source: Setting password...
pt_br: Definindo senha...

# on_boarding_initial_title
source: Welcome to Grabber
pt_br: Bem vindo ao Grabber

# on_boarding_description_title
source: For your first interaction with our product, we need you to complete the initial setup to link it with the Garra system. On behalf of the Grabber team, we thank you for choosing us.
pt_br: Para seu primeiro contato com nosso produto precisamos que você faça as configurações iniciais para vincular com o sistema da Garra. Em nome da equipe do Grabber agradecemos pela preferência.

# default_invalid_token_label
source: Invalid Token
pt_br: Token invalido

# default_invalid_signup_title
source: Sign up error!
pt_br: Erro ao criar cadastro

# default_invalid_signup_description
source: Pleas try again! If error persist, contact our team.
pt_br: Por favor tente novamente! Caso erro persista contate nossa equipe

# mail_page_title
source: Email address
pt_br: Endereço de e-mail

# mail_page_description
source: Modify the email to keep clients informed during their purchases.
pt_br: Mofique o e-mail que seus clientes irão enxergar durante as compras.

# mail_page_field_error
source: Invalid email address
pt_br: Endereço de email inválido

# mail_error_page_title
source: Something went wrong
pt_br: Algo deu errado

# mail_error_page_description
source: It wasn't possible to update your email. Try again, if the error persists, contact our team.
pt_br: Nós não conseguimos atualizar o endereço de e-mail. Por favor, tente novamente ou troque o nome inserido.

# mail_error_page_primary_button_label
source: Try again
pt_br: Tentar novamente

# mail_error_page_secondary_button_label
source: Change email
pt_br: Trocar e-mail

# mail_loading_page_title
source: Updating mail...
pt_br: Atualizando o endereço de e-mail...

# mail_success_page_title
source: Email updated!
pt_br: Endereço de e-mail atulizado!

# home_page_welcome_again_title
source: Welcome {name}
pt_br: Bem-vindo {name}

# home_page_manage_inventory_button_label
source: Manage inventory
pt_br: Gerenciar estoque

# help_title
source: Help Center
pt_br: Central de Ajuda

# help_page_help_message
source: How can we help?
pt_br: Como podemos ajudar?

# help_page_buttom_label
source: Initiate Real Time Chat!
pt_br: Iniciar chat em Tempo Real!

# help_page_send_email
source: Send Email to:
pt_br: Envia um email para:

# inventory_page_title
source: Inventory
pt_br: Estoque

# inventory_page_no_item_registered_description
source: It seems like you haven'y registered any item yet. Register now and start managing your business the best way possible!
pt_br: Parece que você ainda não cadastrou nenhum item. Cadastre um item e comece a gerenciar seu negócio da melhor forma possível!

# inventory_page_no_item_registered_button_labek
source: Add item
pt_br: Adicionar item

# inventory_amount_card_information
source: Amount available: {amount}
pt_br: Quantidade disponível: {amount}

# inventory_error_page_title
source: Something went wrong
pt_br: Algo deu errado

# inventory_error_page_description
source: We couldn't load your store itens. Please try again or contact the suport team.
pt_br: Nós não conseguimos carregar o seu inventário. Por favor, tente novamente ou contate o suporte.

# inventory_page_loading
source: Loading your inventory...
pt_br: Carregando seu estoque...

# add_item_page_title
source: Add Item
pt_br: Adicionar item

# add_item_position_option_label
source: Position
pt_br: Posição

# add_item_name_option_label
source: Name
pt_br: Nome

# add_item_amount_option_label
source: Amount
pt_br: Quantidade

# add_item_description_option_label
source: Description
pt_br: Descrição

# add_item_success_title
source: Item created!
pt_br: Item criado!

# add_item_loading_title
source: Creating item...
pt_br: Criando item...

# add_item_generic_error_description
source: We couldn't create your item. Please try again or contact the suport team.
pt_br: Nós não conseguimos criar o item dessa vez. Por favor, tente novamente ou contate o suporte.

# product_position_cannot_be_empty_error_text
source: Position cannot be empty
pt_br: Posição não pode ser vazia

# product_name_cannot_be_empty_error_text
source: Name cannot be empty
pt_br: Nome não pode ser vazio

# product_amount_cannot_be_empty_error_text
source: Amount cannot be empty
pt_br: Quantidade não pode ser vazia

# product_description_cannot_be_empty_error_text
source: Description cannot be empty
pt_br: Descrição não pode ser vazia

# edit_item_page_title
source: Edit item
pt_br: Editar item

# edit_item_loading_title
source: Editing item
pt_br: Editando item

# edit_item_success_title
source: Item edited!
pt_br: Item editado!

# edit_item_generic_error_description
source: We couldn't edit your item. Please try again or contact the suport team.
pt_br: Nós não conseguimos editar o item dessa vez. Por favor, tente novamente ou contate o suporte.

# edit_item_position_option_label
source: Position
pt_br: Posição

# edit_item_name_option_label
source: Name
pt_br: Nome

# edit_item_amount_option_label
source: Amount
pt_br: Quantidade

# edit_item_description_option_label
source: Description
pt_br: Descrição

# edit_item_button_label
source: Save changes
pt_br: Salvar alterações

# positions_option_button_error
source: Error loading available positions. <bold>Click here</bold> to try to load again.
pt_br: Erro ao carregar posições. <bold>Clique aqui</bold> para tentar carregar as posições novamente.

# informational_card_error_message
source: Error, tap here
pt_br: Erro, clique aqui

# home_available_positions_card
source: Positions available
pt_br: Cubículos livres

# home_available_itens_card
source: Items ending
pt_br: Itens acabando

# order_status_awaiting_payment
source: Awaiting payment
pt_br: Aguardando pagamento

# order_status_processing
source: Processing
pt_br: Processando

# order_status_ready_to_get
source: Ready to take out
pt_br: Pronto para retirada

# order_status_finished
source: Finished
pt_br: Finalizado

# order_value
source: Total value - {value} BRLC
pt_br: Valor total - R$ {value}

# order_check_itens_button_label
source: Verify items
pt_br: Verificar itens

# order_page_title
source: Order #{id}
pt_br: Pedido #{id}

# order_product_card_single_product_value
source: Price of product - {price} BRLC
pt_br: Preço do produto - R$ {price}

# order_product_card_total_value
source: Valor total - {value} BRLC
pt_br: Valor total - R$ {value}

# order_product_amount_bought
source: Amount bought - {amount}
pt_br: Quantidade comprada - {amount}

# home_order_section_title
source: Orders
pt_br: Pedidos

# home_order_section_error_description
source: Something went wrong. We couldn't load in progress orders, try again or contact our support team.
pt_br: Algo deu errado. Não conseguimos carregar os pedidos em andamento, tente novament ou entre em contato com a equipe de suporte.

# home_order_section_error_button_label
source: Try again
pt_br: Tentar novamente

# home_order_section_loaded_button_label
source: Orders history
pt_br: Histórico de pedidos

# home_order_section_loaded_orders_in_progress_title
source: Orders in progress
pt_br: Pedidos em andamento

# home_order_section_loaded_orders_finished_title
source: Finished orders
pt_br: Pedidos finalizados

# home_order_simulate_order_button_label
source: Simulate a order
pt_br: Simule um pedido

# home_low_storage_items_section_title
source: Low storage items
pt_br: Itens com baixo estoque
